<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> –ü—Ä–æ–µ–∫—Ç: –ê–Ω–∞–ª–∏–∑ –≤–∞–∫–∞–Ω—Å–∏–π –∏–∑ HeadHunter

In [119]:
import pandas as pd
import psycopg2

In [ ]:
DBNAME =
USER =
PASSWORD =
HOST =
PORT =

#!!! LOGIN DETAILS REMOVED!!!

In [121]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

In [ ]:
# To avoid displaying warnings about using sqlalchemy
import warnings
warnings.filterwarnings("ignore")

# **Part 1. Preliminary Data Analysis**

1. Execute an SQL query to **count the total number of job vacancies** in the database (`vacancies`).

In [ ]:
query_1_1 = f'''select COUNT(id)
                from vacancies
            '''

In [ ]:
df = pd.read_sql_query(query_1_1, connection)
df

   count
0  49197

2. Determine the **number of registered employers** (`employers`).

In [ ]:
query_1_2 = f'''select COUNT(id)
                from employers
            '''

In [ ]:
df = pd.read_sql_query(query_1_2, connection)
df

   count
0  23501

3. Calculate the **number of regions/cities** represented in the dataset (`areas`).

In [ ]:
query_1_3 = f'''select COUNT(id)
                from areas
            '''

In [ ]:
df = pd.read_sql_query(query_1_3, connection)
df

   count
0   1362

4. Identify the **number of industries** covered in the database (`industries`).

In [ ]:
query_1_4 = f'''select COUNT(id)
                from industries
            '''

In [ ]:
df = pd.read_sql_query(query_1_4, connection)
df

   count
0    294

***

### **Conclusions from Preliminary Data Analysis**  
The analysis of the database revealed the following insights:  
- The dataset contains **49,197 job vacancies** from **23,501 employers** across **1,362 regions**.  
- A total of **294 industries** are represented, indicating a broad coverage of business sectors.  
- Many companies are **direct competitors**, operating in the same geographic areas.  
- The average number of vacancies per employer is **~2.1**, suggesting that many organizations are hiring multiple specialists simultaneously.

# **Part 2. Detailed Job Vacancy Analysis**

1. Execute an SQL query to **determine the number of vacancies in each region (`area`)**.  
   - Sort the results in descending order.

In [ ]:
query_2_1 = f'''select a.name area, COUNT(v.id) cnt
                from vacancies v
                left join areas a on v.area_id = a.id
                group by a.name
                order by 2 DESC 
            '''

In [ ]:
df = pd.read_sql_query(query_2_1, connection)
df

                area   cnt
0             –ú–æ—Å–∫–≤–∞  5333
1    –°–∞–Ω–∫—Ç-–ü–µ—Ç–µ—Ä–±—É—Ä–≥  2851
2              –ú–∏–Ω—Å–∫  2112
3        –ù–æ–≤–æ—Å–∏–±–∏—Ä—Å–∫  2006
4             –ê–ª–º–∞—Ç—ã  1892
..               ...   ...
764       –¢–∞—Ä–∫–æ-–°–∞–ª–µ     1
765    –ù–æ–≤–æ–∞–Ω–Ω–∏–Ω—Å–∫–∏–π     1
766            –ë–∏—Ä—Å–∫     1
767           –°–∞—Å–æ–≤–æ     1
768             –ê–Ω–Ω–∞     1

[769 rows x 2 columns]

2. Identify **the percentage of job postings that specify a salary** (at least one of the two salary fields).

In [ ]:
query_2_2 = f'''select COUNT(id)
                from vacancies
                where (salary_from is not null) or (salary_to is not null)
            '''

In [ ]:
df = pd.read_sql_query(query_2_2, connection)
df

   count
0  24073

3. Calculate **the average lower and upper salary range** (rounded to whole numbers).

In [ ]:
query_2_3 = f'''select round(AVG(salary_from)) avg_from, round(AVG(salary_to)) avg_to
                from vacancies
            '''

In [ ]:
df = pd.read_sql_query(query_2_3, connection)
df

   avg_from    avg_to
0   71065.0  110537.0

4. Retrieve **the number of vacancies for each combination of work schedule (`schedule`) and employment type (`employment`)**.  
   - Sort by descending order.

In [ ]:
query_2_4 = f'''select schedule, employment, count(id) cnt
                from vacancies
                group by 1,2
                order by 3 desc
            '''

In [ ]:
df = pd.read_sql_query(query_2_4, connection)
df

            schedule           employment    cnt
0        –ü–æ–ª–Ω—ã–π –¥–µ–Ω—å     –ü–æ–ª–Ω–∞—è –∑–∞–Ω—è—Ç–æ—Å—Ç—å  35367
1   –£–¥–∞–ª–µ–Ω–Ω–∞—è —Ä–∞–±–æ—Ç–∞     –ü–æ–ª–Ω–∞—è –∑–∞–Ω—è—Ç–æ—Å—Ç—å   7802
2      –ì–∏–±–∫–∏–π –≥—Ä–∞—Ñ–∏–∫     –ü–æ–ª–Ω–∞—è –∑–∞–Ω—è—Ç–æ—Å—Ç—å   1593
3   –£–¥–∞–ª–µ–Ω–Ω–∞—è —Ä–∞–±–æ—Ç–∞  –ß–∞—Å—Ç–∏—á–Ω–∞—è –∑–∞–Ω—è—Ç–æ—Å—Ç—å   1312
4     –°–º–µ–Ω–Ω—ã–π –≥—Ä–∞—Ñ–∏–∫     –ü–æ–ª–Ω–∞—è –∑–∞–Ω—è—Ç–æ—Å—Ç—å    940
5        –ü–æ–ª–Ω—ã–π –¥–µ–Ω—å           –°—Ç–∞–∂–∏—Ä–æ–≤–∫–∞    569
6     –í–∞—Ö—Ç–æ–≤—ã–π –º–µ—Ç–æ–¥     –ü–æ–ª–Ω–∞—è –∑–∞–Ω—è—Ç–æ—Å—Ç—å    367
7        –ü–æ–ª–Ω—ã–π –¥–µ–Ω—å  –ß–∞—Å—Ç–∏—á–Ω–∞—è –∑–∞–Ω—è—Ç–æ—Å—Ç—å    347
8      –ì–∏–±–∫–∏–π –≥—Ä–∞—Ñ–∏–∫  –ß–∞—Å—Ç–∏—á–Ω–∞—è –∑–∞–Ω—è—Ç–æ—Å—Ç—å    312
9        –ü–æ–ª–Ω—ã–π –¥–µ–Ω—å     –ü—Ä–æ–µ–∫—Ç–Ω–∞—è —Ä–∞–±–æ—Ç–∞    141
10  –£–¥–∞–ª–µ–Ω–Ω–∞—è —Ä–∞–±–æ—Ç–∞     –ü—Ä–æ–µ–∫—Ç–Ω–∞—è —Ä–∞–±–æ—Ç–∞    133
11     –ì–∏–±–∫–∏–π –≥—Ä–∞—Ñ–∏–∫           –°—Ç–∞–∂–∏—Ä–æ–≤–∫–∞    116
12    –°–º–µ–Ω–Ω—ã–π –≥—Ä–∞—Ñ–∏–∫  –ß–∞—Å—Ç–∏—á–Ω–∞—è –∑–∞–Ω—è—Ç–æ—Å—Ç—å    101
13  –£–¥–∞–ª–µ–Ω–Ω–∞—è —Ä–∞–±–æ—Ç–∞           –°—Ç–∞–∂–∏—Ä–æ–≤–∫–∞     64
14     –ì–∏–±–∫–∏–π –≥—Ä–∞—Ñ–∏–∫     –ü—Ä–æ–µ–∫—Ç–Ω–∞—è —Ä–∞–±–æ—Ç–∞     18
15    –°–º–µ–Ω–Ω—ã–π –≥—Ä–∞—Ñ–∏–∫           –°—Ç–∞–∂–∏—Ä–æ–≤–∫–∞     12
16    –í–∞—Ö—Ç–æ–≤—ã–π –º–µ—Ç–æ–¥     –ü—Ä–æ–µ–∫—Ç–Ω–∞—è —Ä–∞–±–æ—Ç–∞      2
17    –°–º–µ–Ω–Ω—ã–π –≥—Ä–∞—Ñ–∏–∫     –ü—Ä–æ–µ–∫—Ç–Ω–∞—è —Ä–∞–±–æ—Ç–∞      1

5. Determine **which experience levels (`experience`) are least frequently mentioned in job postings**.

In [ ]:
query_2_5 = f'''select experience as "–¢—Ä–µ–±—É–µ–º—ã–π –æ–ø—ã—Ç —Ä–∞–±–æ—Ç—ã", count(id) cnt
                from vacancies
                group by 1
                order by 2
            '''

In [ ]:
df = pd.read_sql_query(query_2_5, connection)
df

  –¢—Ä–µ–±—É–µ–º—ã–π –æ–ø—ã—Ç —Ä–∞–±–æ—Ç—ã    cnt
0           –ë–æ–ª–µ–µ 6 –ª–µ—Ç   1337
1             –ù–µ—Ç –æ–ø—ã—Ç–∞   7197
2         –û—Ç 3 –¥–æ 6 –ª–µ—Ç  14511
3    –û—Ç 1 –≥–æ–¥–∞ –¥–æ 3 –ª–µ—Ç  26152

***

### **Conclusions from Detailed Job Vacancy Analysis**  

üîπ **Job distribution by region:**  
The largest cities, such as **Moscow, Saint Petersburg, and Novosibirsk**, have the highest number of job openings, aligning with general labor market trends.  

üîπ **Salary information availability:**  
- **49% of job postings** include at least one salary field.  
- A significant portion of employers **do not disclose salary ranges**, making automated analysis and prediction more challenging.  

üîπ **Work schedule and employment type:**  
- Most employers offer **full-time, in-office positions**.  
- Flexible schedules and remote work options are available but less common.  

üîπ **Salary expectations:**  
- The average salary range is **from 71,000 to 110,000 RUB**.  
- The most in-demand employees have **1‚Äì3 years of experience**.

# **Part 3. Employer Analysis**

1. Execute an SQL query to **identify the TOP-5 employers** by the number of job vacancies.

In [ ]:
query_3_1 = f'''select e.name, count(v.id) cnt
                from vacancies v
                left join employers e on v.employer_id=e.id
                group by 1
                order by 2 desc
                limit 5
            '''

In [ ]:
df = pd.read_sql_query(query_3_1, connection)
df

            name   cnt
0         –Ø–Ω–¥–µ–∫—Å  1933
1     –†–æ—Å—Ç–µ–ª–µ–∫–æ–º   491
2       –¢–∏–Ω—å–∫–æ—Ñ—Ñ   444
3           –°–ë–ï–†   428
4  –ì–∞–∑–ø—Ä–æ–º –Ω–µ—Ñ—Ç—å   331

2. Determine the **number of employers and job vacancies in each region**.  
   - Identify the region with the highest number of employers but no vacancies.

In [ ]:
query_3_2 = f'''select a.name, count(distinct e.id) employers, count(distinct v.id) vacancies
                from areas a 
                left join employers e on a.id=e.area
                left join vacancies v on v.area_id=e.area
                where v.id is null
                group by 1
                order by 3, 2 desc
            '''

In [ ]:
df = pd.read_sql_query(query_3_2, connection)
df

                      name  employers  vacancies
0                   –†–æ—Å—Å–∏—è        410          0
1                –ö–∞–∑–∞—Ö—Å—Ç–∞–Ω        207          0
2       –ú–æ—Å–∫–æ–≤—Å–∫–∞—è –æ–±–ª–∞—Å—Ç—å         75          0
3       –ö—Ä–∞—Å–Ω–æ–¥–∞—Ä—Å–∫–∏–π –∫—Ä–∞–π         19          0
4                 –ë–µ–ª–∞—Ä—É—Å—å         18          0
..                     ...        ...        ...
889                –ñ–∞–±–∏–Ω–∫–∞          0          0
890  –ñ–µ–ª–µ–∑–Ω–æ–≥–æ—Ä—Å–∫-–ò–ª–∏–º—Å–∫–∏–π          0          0
891                –ñ–µ—Ç—ã—Å–∞–π          0          0
892               –ñ–∏–≥–∞–ª–æ–≤–æ          0          0
893               –ñ–∏—Ä–Ω–æ–≤—Å–∫          0          0

[894 rows x 3 columns]

3. Calculate the **number of regions where each employer has job postings**.  
   - Sort the results in descending order.

In [ ]:
query_3_3 = f'''select e.name employer, count(distinct v.area_id) cnt
                from vacancies v
                left join employers e on v.employer_id=e.id
                group by 1
                order by 2 desc
            '''

In [ ]:
df = pd.read_sql_query(query_3_3, connection)
df

                     employer  cnt
0                      –Ø–Ω–¥–µ–∫—Å  181
1                  –†–æ—Å—Ç–µ–ª–µ–∫–æ–º  152
2                  –°–ø–µ—Ü—Ä–µ–º–æ–Ω—Ç  116
3      –ü–æ–ª—è–∫–æ–≤ –î–µ–Ω–∏—Å –ò–≤–∞–Ω–æ–≤–∏—á   88
4                   –û–û–û –ï–§–ò–ù    71
...                       ...  ...
14761                  UniSol    1
14762            UNISTORY LLC    1
14763                   UNIT6    1
14764     United Distribution    1
14765              UNITEL LLC    1

[14766 rows x 2 columns]

4. Count **the number of employers without an assigned industry**.

In [ ]:
query_3_4 = f'''select count(distinct e.id)
                from employers e
                left join employers_industries s on e.id=s.employer_id
                where s.industry_id is null
            '''

In [ ]:
df = pd.read_sql_query(query_3_4, connection)
df

   count
0   8419

5. Find **the company ranked third alphabetically** among employers with four industry classifications.

In [ ]:
query_3_5 = f'''select e.name, count(s.industry_id)
                from employers e
                left join employers_industries s on e.id=s.employer_id
                group by 1
                having count(s.industry_id)=4
                order by 1
                offset 2
                limit 1
            '''

In [ ]:
df = pd.read_sql_query(query_3_5, connection)
df

   name  count
0  2–ì–ò–°      4

6. Identify **the number of employers specializing in software development**.

In [ ]:
query_3_6 = f'''select count(distinct s.employer_id)
                from employers_industries s
                left join industries i on i.id=s.industry_id
                where i.name = '–†–∞–∑—Ä–∞–±–æ—Ç–∫–∞ –ø—Ä–æ–≥—Ä–∞–º–º–Ω–æ–≥–æ –æ–±–µ—Å–ø–µ—á–µ–Ω–∏—è' 
            '''

In [ ]:
df = pd.read_sql_query(query_3_6, connection)
df

   count
0   3553

7. Analyze **Yandex job postings** in cities with over 1 million residents.  
   - Include a `Total` row with the overall number of job openings.

In [ ]:
import urllib.parse as req

path_common = req.urlparse('https://ru.wikipedia.org/wiki/–ì–æ—Ä–æ–¥–∞-–º–∏–ª–ª–∏–æ–Ω–µ—Ä—ã_–†–æ—Å—Å–∏–∏#–°–ø–∏—Å–æ–∫_–≥–æ—Ä–æ–¥–æ–≤-–º–∏–ª–ª–∏–æ–Ω–µ—Ä–æ–≤')
url = path_common.scheme + '://' + req.quote(path_common.netloc) +  req.quote(path_common.path) + '#'+ req.quote(path_common.fragment)

cities=pd.read_html(url)[0]
cities=tuple(cities['–ì–æ—Ä–æ–¥'])
display(cities)

('–ú–æ—Å–∫–≤–∞',
 '–°–∞–Ω–∫—Ç-–ü–µ—Ç–µ—Ä–±—É—Ä–≥',
 '–ù–æ–≤–æ—Å–∏–±–∏—Ä—Å–∫',
 '–ï–∫–∞—Ç–µ—Ä–∏–Ω–±—É—Ä–≥',
 '–ö–∞–∑–∞–Ω—å',
 '–ö—Ä–∞—Å–Ω–æ—è—Ä—Å–∫',
 '–ù–∏–∂–Ω–∏–π –ù–æ–≤–≥–æ—Ä–æ–¥',
 '–ß–µ–ª—è–±–∏–Ω—Å–∫',
 '–£—Ñ–∞',
 '–°–∞–º–∞—Ä–∞',
 '–†–æ—Å—Ç–æ–≤-–Ω–∞-–î–æ–Ω—É',
 '–ö—Ä–∞—Å–Ω–æ–¥–∞—Ä',
 '–û–º—Å–∫',
 '–í–æ—Ä–æ–Ω–µ–∂',
 '–ü–µ—Ä–º—å',
 '–í–æ–ª–≥–æ–≥—Ä–∞–¥')

In [ ]:
query_3_7 = f'''select a.name, count(v.id) cnt
                from vacancies v
                left join areas a on v.area_id=a.id
                left join employers e on v.employer_id=e.id
                where e.name = '–Ø–Ω–¥–µ–∫—Å' and a.name in {cities}
                group by a.name
                
                union
                select 'Total', count(v.id)
                from vacancies v
                left join areas a on v.area_id=a.id
                left join employers e on v.employer_id=e.id
                where e.name = '–Ø–Ω–¥–µ–∫—Å' and a.name in {cities}
                order by 2
                
            '''

In [ ]:
df = pd.read_sql_query(query_3_7, connection)
df

               name  cnt
0              –û–º—Å–∫   21
1         –ß–µ–ª—è–±–∏–Ω—Å–∫   22
2        –ö—Ä–∞—Å–Ω–æ—è—Ä—Å–∫   23
3         –í–æ–ª–≥–æ–≥—Ä–∞–¥   24
4             –ü–µ—Ä–º—å   25
5            –ö–∞–∑–∞–Ω—å   25
6    –†–æ—Å—Ç–æ–≤-–Ω–∞-–î–æ–Ω—É   25
7               –£—Ñ–∞   26
8            –°–∞–º–∞—Ä–∞   26
9         –ö—Ä–∞—Å–Ω–æ–¥–∞—Ä   30
10          –í–æ—Ä–æ–Ω–µ–∂   32
11      –ù–æ–≤–æ—Å–∏–±–∏—Ä—Å–∫   35
12  –ù–∏–∂–Ω–∏–π –ù–æ–≤–≥–æ—Ä–æ–¥   36
13     –ï–∫–∞—Ç–µ—Ä–∏–Ω–±—É—Ä–≥   39
14  –°–∞–Ω–∫—Ç-–ü–µ—Ç–µ—Ä–±—É—Ä–≥   42
15           –ú–æ—Å–∫–≤–∞   54
16            Total  485

***

### **Conclusions from Employer Analysis**  

üîπ **Top Employers:**  
The leading employers in terms of job postings include **–Ø–Ω–¥–µ–∫—Å, –†–æ—Å—Ç–µ–ª–µ–∫–æ–º, –¢–∏–Ω—å–∫–æ—Ñ—Ñ**.  
These organizations are either **major IT firms** or companies that heavily rely on data processing, creating a strong demand for tech professionals.  

üîπ **Software Development Sector:**  
- **3,553 out of 23,501 employers** in the dataset are focused on **software development**.  
- This highlights **significant employment opportunities in the IT industry**.  

üîπ **Geographic Reach:**  
- **Yandex** is the **leader in geographic coverage**, with job postings in most **major metropolitan areas**.  
- This indicates its continued expansion and a high demand for specialists nationwide.

# **Part 4. Domain-Specific Analysis**

1. Determine the **number of data-related job vacancies**.  
   - A job is classified as "data-related" if its title contains `'data'` or `'–¥–∞–Ω–Ω'`.

In [ ]:
query_4_1 = f'''select count(id)
                from vacancies
                where lower(name) like '%data%' or lower(name) like '%–¥–∞–Ω–Ω%'
            '''

In [ ]:
df = pd.read_sql_query(query_4_1, connection)
df

   count
0   1771

2. Calculate the **number of entry-level Data Scientist job postings**.  
   - Included job titles:  
     * 'data scientist'  
     * 'data science'  
     * '–∏—Å—Å–ª–µ–¥–æ–≤–∞—Ç–µ–ª—å –¥–∞–Ω–Ω—ã—Ö'  
     * 'ML' (excluding `HTML`)  
     * 'machine learning'  
     * '–º–∞—à–∏–Ω–Ω%–æ–±—É—á–µ–Ω%'  
   - A **Junior-level** position meets at least one of these criteria:  
     * The title contains `'junior'`.  
     * Required experience = `'–ù–µ—Ç –æ–ø—ã—Ç–∞'`.  
     * Employment type = `'–°—Ç–∞–∂–∏—Ä–æ–≤–∫–∞'`.

In [ ]:
query_4_2 = f'''select count(distinct id)
                from vacancies
                where ((name ilike '%data scientist%'
                or name ilike '%data science%' 
                or name ilike '%–∏—Å—Å–ª–µ–¥–æ–≤–∞—Ç–µ–ª—å –¥–∞–Ω–Ω—ã—Ö%'
                or name ilike '%machine learning%'
                or name ilike '%–º–∞—à–∏–Ω–Ω%–æ–±—É—á–µ–Ω%')
                or (name not like '%HTML%' and name like '%ML%'))
                and (name ilike '%junior%' 
                or experience ilike '%–Ω–µ—Ç –æ–ø—ã—Ç–∞%' 
                or employment ilike '%—Å—Ç–∞–∂–∏—Ä–æ–≤–∫–∞%')
            '''

In [ ]:
df = pd.read_sql_query(query_4_2, connection)
df

   count
0     51

3. Count **how many DS job postings require SQL or PostgreSQL as a key skill**.

In [ ]:
query_4_3 = f'''select count(distinct id)
                from vacancies
                where ((name ilike '%data scientist%'
                or name ilike '%data science%' 
                or name ilike '%–∏—Å—Å–ª–µ–¥–æ–≤–∞—Ç–µ–ª—å –¥–∞–Ω–Ω—ã—Ö%'
                or name ilike '%machine learning%'
                or name ilike '%–º–∞—à–∏–Ω–Ω%–æ–±—É—á–µ–Ω%')
                or (name not like '%HTML%' and name like '%ML%'))
                and (key_skills ilike '%SQL%'
                or key_skills ilike '%postgres%')
            '''

In [ ]:
df = pd.read_sql_query(query_4_3, connection)
df

   count
0    201

4. Assess **the popularity of Python** among employer requirements.  
   - Number of job postings where Python is listed as a key skill.

In [ ]:
query_4_4 = f'''select count(distinct id)
                from vacancies
                where ((name ilike '%data scientist%'
                or name ilike '%data science%' 
                or name ilike '%–∏—Å—Å–ª–µ–¥–æ–≤–∞—Ç–µ–ª—å –¥–∞–Ω–Ω—ã—Ö%'
                or name ilike '%machine learning%'
                or name ilike '%–º–∞—à–∏–Ω–Ω%–æ–±—É—á–µ–Ω%')
                or (name not like '%HTML%' and name like '%ML%'))
                and (key_skills ilike '%Python%')
            '''

In [ ]:
df = pd.read_sql_query(query_4_4, connection)
df

   count
0    351

5. Determine **the average number of key skills** listed in DS job postings.  
   - Round the result to two decimal places.

In [ ]:
query_4_5 = f'''select round(avg(length(key_skills)-length(replace(key_skills, CHR(9), ''))+1), 2)
                from vacancies
                where ((name ilike '%data scientist%'
                or name ilike '%data science%' 
                or name ilike '%–∏—Å—Å–ª–µ–¥–æ–≤–∞—Ç–µ–ª—å –¥–∞–Ω–Ω—ã—Ö%'
                or name ilike '%machine learning%'
                or name ilike '%–º–∞—à–∏–Ω–Ω%–æ–±—É—á–µ–Ω%')
                or (name not like '%HTML%' and name like '%ML%'))
                and key_skills is not null
                order by 1
            '''

In [ ]:
df = pd.read_sql_query(query_4_5, connection)
df

   round
0   6.41

6. Calculate **the average salary for DS jobs** based on required experience levels.  
   - Identify **the expected salary range for candidates with 3‚Äì6 years of experience**.  
   - Round to the nearest whole number.

In [ ]:
query_4_6 = f'''select experience, round(avg((coalesce(salary_from, salary_to)+coalesce(salary_to, salary_from))/2), 0) as avg_salary
                from vacancies
                where ((name ilike '%data scientist%'
                or name ilike '%data science%' 
                or name ilike '%–∏—Å—Å–ª–µ–¥–æ–≤–∞—Ç–µ–ª—å –¥–∞–Ω–Ω—ã—Ö%'
                or name ilike '%machine learning%'
                or name ilike '%–º–∞—à–∏–Ω–Ω%–æ–±—É—á–µ–Ω%')
                or (name not like '%HTML%' and name like '%ML%'))
                and (salary_from is not null or salary_to is not null)
                group by experience   
            '''

In [ ]:
df = pd.read_sql_query(query_4_6, connection)
df

           experience  avg_salary
0           –ù–µ—Ç –æ–ø—ã—Ç–∞     74643.0
1  –û—Ç 1 –≥–æ–¥–∞ –¥–æ 3 –ª–µ—Ç    139675.0
2       –û—Ç 3 –¥–æ 6 –ª–µ—Ç    243115.0

### **Conclusions from Domain-Specific Analysis**  

üîπ **Filtered Job Selection:**  
After applying DS-specific criteria, the number of relevant vacancies **was reduced to 1,771**.  

üîπ **Job Availability for Entry-Level Candidates:**  
- **Only 2.8% of DS job postings** are open to **candidates without experience**.  
- This confirms the **high entry barrier** for Data Science positions.  

üîπ **Skill Popularity:**  
- **20% of DS job postings** require **Python** as a key skill.  
- **11% of DS job postings** require **SQL**.  
- On average, employers look for candidates **with 6‚Äì7 key skills**.  

üîπ **Salary Expectations:**  
- Salaries in Data Science **increase rapidly with experience**.  
- Experienced specialists earn **3‚Äì4 times more** than entry-level employees.  
- The average salary for candidates with **3‚Äì6 years of experience** is **243 115 RUB**.

***

# **Part 5. Additional Research**

üîπ **Choosing the Best Region for Job Seekers**

In [ ]:
# The first query selects regions where job vacancies for our clients are currently open  
# and lists them in descending order by the number of potential employers.  
query_5_1 = f'''select a.name as "–Ω–∞–∑–≤–∞–Ω–∏–µ —Ä–µ–≥–∏–æ–Ω–∞", COUNT(distinct v.employer_id) as "—Å –æ—Ç–∫—Ä—ã—Ç—ã–º–∏ –≤–∞–∫–∞–Ω—Å–∏—è–º–∏"
                from areas a
                left join vacancies v on a.id=v.area_id
                where ((v.name ilike '%data scientist%'
                or v.name ilike '%data science%' 
                or v.name ilike '%–∏—Å—Å–ª–µ–¥–æ–≤–∞—Ç–µ–ª—å –¥–∞–Ω–Ω—ã—Ö%'
                or v.name ilike '%machine learning%'
                or v.name ilike '%–º–∞—à–∏–Ω–Ω%–æ–±—É—á–µ–Ω%')
                or (v.name not like '%HTML%' and v.name like '%ML%'))
                group by 1
                order by 2 desc
            '''

In [ ]:
# Based on the query results, we form the first part of the DataFrame  
# and create a tuple with the names of the selected regions.
df1 = pd.read_sql_query(query_5_1, connection)
regions = tuple(df1['–Ω–∞–∑–≤–∞–Ω–∏–µ —Ä–µ–≥–∏–æ–Ω–∞'])

In [ ]:
# The second query retrieves the number of potential employers for IT specialists  
# in the regions selected in the first query.  
# This query requires joining four tables, even though the final output only contains data from two of them.  
# The other tables are used for linking and filtering conditions.  
query_5_2 = f'''select a.name as "–Ω–∞–∑–≤–∞–Ω–∏–µ —Ä–µ–≥–∏–æ–Ω–∞", COUNT(distinct e.id) as "—Ä–∞–±–æ—Ç–æ–¥–∞—Ç–µ–ª–∏ –≤ –ò–¢ —Å—Ñ–µ—Ä–µ"
                from areas a
                left join employers e on a.id=e.area
                left join employers_industries s on e.id=s.employer_id
                left join industries i on s.industry_id=i.id
                where (i.name like '%–ò–¢%'
                or i.name ilike '%–∏–Ω—Ç–µ—Ä–Ω–µ—Ç%' 
                or i.name like '–†–∞–∑—Ä–∞–±–æ—Ç–∫–∞ –ø—Ä–æ–≥—Ä–∞–º–º–Ω–æ–≥–æ –æ–±–µ—Å–ø–µ—á–µ–Ω–∏—è'
                or i.name like '–ú–æ–±–∏–ª—å–Ω–∞—è —Å–≤—è–∑—å'
                or i.name like '–ë–∞–Ω–∫')
                and a.name in {regions}
                group by 1
                order by 2 desc
            '''

In [ ]:
# Forming the second part of the table.  
df2 = pd.read_sql_query(query_5_2, connection)

# Merging the data into a single table.  
merged_df=df1.merge(
    df2,
    how='left',
    on='–Ω–∞–∑–≤–∞–Ω–∏–µ —Ä–µ–≥–∏–æ–Ω–∞'
)
# Replacing missing values with 0 and displaying the final result. 
merged_df=merged_df.fillna(0)
merged_df

             –Ω–∞–∑–≤–∞–Ω–∏–µ —Ä–µ–≥–∏–æ–Ω–∞  —Å –æ—Ç–∫—Ä—ã—Ç—ã–º–∏ –≤–∞–∫–∞–Ω—Å–∏—è–º–∏  —Ä–∞–±–æ—Ç–æ–¥–∞—Ç–µ–ª–∏ –≤ –ò–¢ —Å—Ñ–µ—Ä–µ
0                      –ú–æ—Å–∫–≤–∞                     130                   1739.0
1             –°–∞–Ω–∫—Ç-–ü–µ—Ç–µ—Ä–±—É—Ä–≥                      47                    678.0
2                 –ù–æ–≤–æ—Å–∏–±–∏—Ä—Å–∫                      17                    166.0
3                      –ö–∞–∑–∞–Ω—å                      13                    133.0
4                      –ê–ª–º–∞—Ç—ã                      11                    262.0
5             –ù–∏–∂–Ω–∏–π –ù–æ–≤–≥–æ—Ä–æ–¥                       9                     95.0
6                       –ú–∏–Ω—Å–∫                       9                    515.0
7                –ï–∫–∞—Ç–µ—Ä–∏–Ω–±—É—Ä–≥                       6                    134.0
8                       –¢–æ–º—Å–∫                       6                     57.0
9                   –ö—Ä–∞—Å–Ω–æ–¥–∞—Ä                       6                     81.0
10                      –ü–µ—Ä–º—å                       5                     62.0
11             –†–æ—Å—Ç–æ–≤-–Ω–∞-–î–æ–Ω—É                       5                     91.0
12                 –ù—É—Ä-–°—É–ª—Ç–∞–Ω                       4                    123.0
13                     –°–∞–º–∞—Ä–∞                       4                     73.0
14                       –û–º—Å–∫                       3                     40.0
15                    –¢–∞—à–∫–µ–Ω—Ç                       3                    147.0
16                     –°–µ—Ä–±–∏—è                       3                      0.0
17                       –ö–∏–ø—Ä                       3                     15.0
18                    –ê—Ä–º–µ–Ω–∏—è                       3                      7.0
19                     –†—è–∑–∞–Ω—å                       3                     19.0
20                    –¢–±–∏–ª–∏—Å–∏                       3                      8.0
21                  –ò–Ω–Ω–æ–ø–æ–ª–∏—Å                       2                      5.0
22                      –ß–µ—Ö–∏—è                       2                      4.0
23  –ö–∏—Ä–æ–≤ (–ö–∏—Ä–æ–≤—Å–∫–∞—è –æ–±–ª–∞—Å—Ç—å)                       2                     29.0
24                –í–ª–∞–¥–∏–≤–æ—Å—Ç–æ–∫                       2                     21.0
25                     –¢—É—Ä—Ü–∏—è                       2                      1.0
26                    –í–æ—Ä–æ–Ω–µ–∂                       2                     60.0
27                        –£—Ñ–∞                       2                     35.0
28                      –ü–µ–Ω–∑–∞                       2                     25.0
29           –ù–∞–±–µ—Ä–µ–∂–Ω—ã–µ –ß–µ–ª–Ω—ã                       1                      7.0
30                       –ë–∞–∫—É                       1                      2.0
31                    –ë–∞—Ä–Ω–∞—É–ª                       1                     31.0
32                     –ë–∞—Ç—É–º–∏                       1                      1.0
33                   –ë–µ–ª–≥–æ—Ä–æ–¥                       1                     18.0
34                     –ë–∏—à–∫–µ–∫                       1                     44.0
35                     –ë—Ä—è–Ω—Å–∫                       1                     16.0
36                  –í–æ–ª–≥–æ–≥—Ä–∞–¥                       1                     34.0
37                 –ó–µ–ª–µ–Ω–æ–≥—Ä–∞–¥                       1                      5.0
38                     –ò–∂–µ–≤—Å–∫                       1                     48.0
39                    –ò–∑—Ä–∞–∏–ª—å                       1                      0.0
40                    –ö–æ—Ä–æ–ª–µ–≤                       1                      2.0
41                 –ö—Ä–∞—Å–Ω–æ—è—Ä—Å–∫                       1                     38.0
42                      –õ–∏—Ç–≤–∞                       1                      3.0
43                    –ê–±—Ö–∞–∑–∏—è                       1                      0.0
44                       –û—Ä–µ–ª                       1                     10.0
45               –ü–µ—Ç—Ä–æ–∑–∞–≤–æ–¥—Å–∫                       1                      9.0
46                     –ü–æ–ª—å—à–∞                       1                      1.0
47                    –°–∞—Ä–∞—Ç–æ–≤                       1                     26.0
48                      –¢–≤–µ—Ä—å                       1                     17.0
49                     –¢—é–º–µ–Ω—å                       1                     41.0
50                  –ß–µ–ª—è–±–∏–Ω—Å–∫                       1                     59.0
51                 –ß–µ—Ä–Ω–æ–≥–æ—Ä–∏—è                       1                      1.0

- To determine **the most promising regions**, it is important to consider **not only the number of current vacancies but also the total number of employers**.  
- As expected, the **highest concentration of vacancies and employers** is in **Moscow**.  
- However, **many companies register their headquarters in Moscow**, which **may distort the real distribution**.  
- Beyond Moscow, **capital cities and metropolitan areas** stand out as **attractive options for relocation and career growth**.

üîπ **Optimal Work Schedule for Data Scientists**

In [ ]:
query_5_3 = f'''select schedule, employment, round(AVG(salary_from)) avg_from, round(AVG(salary_to)) avg_to, count(id) cnt
                from vacancies
                where ((name ilike '%data scientist%'
                or name ilike '%data science%' 
                or name ilike '%–∏—Å—Å–ª–µ–¥–æ–≤–∞—Ç–µ–ª—å –¥–∞–Ω–Ω—ã—Ö%'
                or name ilike '%machine learning%'
                or name ilike '%–º–∞—à–∏–Ω–Ω%–æ–±—É—á–µ–Ω%')
                or (name not like '%HTML%' and name like '%ML%'))
                group by 1,2
                order by 3 desc, 4 desc
            '''

In [ ]:
df = pd.read_sql_query(query_5_3, connection)
df

           schedule           employment  avg_from    avg_to  cnt
0     –ì–∏–±–∫–∏–π –≥—Ä–∞—Ñ–∏–∫  –ß–∞—Å—Ç–∏—á–Ω–∞—è –∑–∞–Ω—è—Ç–æ—Å—Ç—å       NaN       NaN    4
1       –ü–æ–ª–Ω—ã–π –¥–µ–Ω—å           –°—Ç–∞–∂–∏—Ä–æ–≤–∫–∞       NaN       NaN    2
2  –£–¥–∞–ª–µ–Ω–Ω–∞—è —Ä–∞–±–æ—Ç–∞     –ü—Ä–æ–µ–∫—Ç–Ω–∞—è —Ä–∞–±–æ—Ç–∞       NaN   90000.0    2
3     –ì–∏–±–∫–∏–π –≥—Ä–∞—Ñ–∏–∫           –°—Ç–∞–∂–∏—Ä–æ–≤–∫–∞       NaN   37000.0    2
4  –£–¥–∞–ª–µ–Ω–Ω–∞—è —Ä–∞–±–æ—Ç–∞     –ü–æ–ª–Ω–∞—è –∑–∞–Ω—è—Ç–æ—Å—Ç—å  176850.0  242138.0  110
5       –ü–æ–ª–Ω—ã–π –¥–µ–Ω—å     –ü–æ–ª–Ω–∞—è –∑–∞–Ω—è—Ç–æ—Å—Ç—å  140763.0  228936.0  319
6     –ì–∏–±–∫–∏–π –≥—Ä–∞—Ñ–∏–∫     –ü–æ–ª–Ω–∞—è –∑–∞–Ω—è—Ç–æ—Å—Ç—å  140000.0  200000.0   37
7  –£–¥–∞–ª–µ–Ω–Ω–∞—è —Ä–∞–±–æ—Ç–∞  –ß–∞—Å—Ç–∏—á–Ω–∞—è –∑–∞–Ω—è—Ç–æ—Å—Ç—å  119000.0       NaN    3
8       –ü–æ–ª–Ω—ã–π –¥–µ–Ω—å  –ß–∞—Å—Ç–∏—á–Ω–∞—è –∑–∞–Ω—è—Ç–æ—Å—Ç—å   45000.0  100000.0    1

- Based on salary analysis and vacancy numbers, **remote work with full-time employment** is the **most financially beneficial option**.  
- This format offers **a sufficient number of job opportunities**, and salaries are **on average 13% higher** than those for traditional office-based roles.  
- The first four schedule and employment type combinations **are less attractive** due to **a limited number of job postings and unclear salary ranges**.

In [ ]:
# Closing the database connection. 
connection.close()

---

## **General Conclusions from the Project**  

üìå **Demand for Data Science Specialists**  
- Out of **49,197 job postings**, only **1,771 (3.6%)** are related to **Data Science**.  
- This confirms that **data professionals are in high demand**, but the job market remains **competitive**.  
- The largest hiring hubs are **capital cities and major metropolitan areas**.  

üìå **Key Factors in Job Matching**  
- **Work experience** and **essential skills** (Python, SQL, ML) are **the primary hiring criteria**.  
- **Remote work is gaining popularity**, offering **higher average salaries**.  
- **Matching candidates with employer requirements** is crucial for job search success.  

üìå **Recommendations for Building an ML-Based Job Matching System**  
- **A single data source (HeadHunter) is insufficient** ‚Üí integrating multiple job boards would improve **recommendation accuracy**.  
- **Additional factors** (job categories, market trends, skill requirements) can **enhance the model‚Äôs predictive power**.  
- **Long-term trend analysis** (e.g., growth in remote work) will ensure **the model remains relevant over time**.